STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/app_ble.c
  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);
  if (ret != BLE_STATUS_SUCCESS)
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
    }
    else
    {
      APP_DBG_MSG("==>> Start Low Power Advertising Failed , result: %d \n\r", ret);
    }
  }
  else
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
      /* Start Timer to STOP ADV - TIMEOUT - and next Restart Low Power Advertising */
      HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);
    }
    else
    {
      APP_DBG_MSG("==>> Success: Start Low Power Advertising \n\r");
    }
  }

  return;
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *p_otp_addr;
  const uint8_t *p_bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS
 *
 *************************************************************/
static void Add_Advertisment_Service_UUID(uint16_t servUUID)
{
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID & 0xFF);
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID >> 8) & 0xFF;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;

  return;
}

static void Adv_Mgr(void)
{
  /**
   * The code shall be executed in the background as an aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_UPDATE_ID, CFG_SCH_PRIO_0);

  return;
}

static void Adv_Update(void)
{
  Adv_Request(APP_BLE_LP_ADV);

  return;
}

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

void APP_BLE_Peer_Bonded_Check(void)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t Security_Mode, Security_Level;

  result = aci_gap_is_device_bonded(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  if (result == BLE_STATUS_SUCCESS)
  {
    BleApplicationContext.Peer_Bonded = 0x01;
  }
  else 
  {
    BleApplicationContext.Peer_Bonded = 0x00;
  }
    
  result = aci_gap_get_security_level(BleApplicationContext.connection_handle,&Security_Mode,&Security_Level);
  BleApplicationContext.Security_Mode = Security_Mode;
  BleApplicationContext.Security_Level = Security_Level;
  if (result == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Peer_Bonded=%d Security_Mode=%d, Security_Level=%d \n\r", BleApplicationContext.Peer_Bonded, Security_Mode, Security_Level);
  }

  return;	
}

void APP_BLE_Remove_Bonding_Info(void)
{
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device \n\r");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  aci_gap_clear_security_db();
  return;
}

void APP_BLE_Slave_Security_Request(void)
{
  APP_BLE_Peer_Bonded_Check();
  
  if ((BleApplicationContext.Peer_Bonded == 0x00) ||
      ( (BleApplicationContext.Peer_Bonded == 0x01) && (BleApplicationContext.Security_Mode == 0x01) && (BleApplicationContext.Security_Level == 0x01) )
    )
  {
    GapProcReq(GAP_PROC_SLAVE_SECURITY_REQ);
  }
  
  return;
}

static void GapProcReq(GapProcId_t GapProcId)
{
  tBleStatus status;

  switch(GapProcId)
  {
    case GAP_PROC_SLAVE_SECURITY_REQ:
    {
      BleApplicationContext.Security_Request = 0x01;
      status = aci_gap_slave_security_req(BleApplicationContext.connection_handle); 
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ aci_gap_slave_security_req  status=0x%02x \n\r",status);
      }
      
      //APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ waiting for ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE \n\r");
      //gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE */
      //APP_DBG_MSG("GAP_PROC_SLAVE_SECURITY_REQ waited for ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE  \n\r");
      
      APP_DBG_MSG("waiting for  ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE \n\r");
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
      BleApplicationContext.Security_Request = 0x00;
      APP_DBG_MSG("waited for  ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE \n\r");
    }
      break;

    case GAP_PROC_PASS_KEY_RESPONSE:
    {
      APP_DBG_MSG("GAP_PROC_PASS_KEY_RESPONSE \n\r");
      aci_gap_pass_key_resp(BleApplicationContext.connection_handle, CFG_FIXED_PIN);/* response for ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */
    }
      break;

    case GAP_PROC_ALLOW_REBOND:
    {
      APP_DBG_MSG("GAP_PROC_ALLOW_REBOND aci_gap_allow_rebond(0x%04X)\n\r",BleApplicationContext.connection_handle);
      aci_gap_allow_rebond(BleApplicationContext.connection_handle);/* response for ACI_GAP_BOND_LOST_VSEVT_CODE */
    }
      break;

    case GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.connection_handle, 1); /* CONFIRM_YES = 1 */
      
      APP_DBG_MSG("GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM ** aci_gap_numeric_comparison_value_confirm_yesno-->YES \n");
    }
      break;
		  
    case GAP_PROC_TERMINATE_CONNECTION:
    {
      APP_DBG_MSG("terminate connection \n");
      status = aci_gap_terminate(BleApplicationContext.connection_handle,0x13);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Term Connection cmd failure: 0x%x\n", status);
      }
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);
      
      APP_DBG_MSG("GAP_PROC_TERMINATE_CONNECTION complete event received\n");
    }
      break;
	  
    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GAP_PROC_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GAP_PROC_COMPLETE);
  return;
}

